In [254]:
import pandas as pd
import numpy as np
import re

fires = pd.read_csv("./2024USFires.csv")

In [255]:
fires.head()

              Name   State         County   Acres Start Date Containment Date
0         National  Alaska  Yukon-Koyukuk  15,381    June 30        October 3
1    Sushana River  Alaska         Denali   1,261    June 27        October 9
2      Quinn Creek  Alaska         Bethel   2,709    June 26        August 16
3      East Toklat  Alaska         Denali  29,612    June 26        October 9
4  Gold King Creek  Alaska         Denali   6,538    June 26        October 9

In [256]:
fires.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472 entries, 0 to 471
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              472 non-null    object
 1   State             472 non-null    object
 2   County            472 non-null    object
 3   Acres             472 non-null    object
 4   Start Date        472 non-null    object
 5   Containment Date  471 non-null    object
dtypes: object(6)
memory usage: 22.3+ KB

In [257]:
# Add the year as a column
fires['Year'] = 2024

In [258]:
# Replace spaces in counties with ''
fires['County'] = fires['County'].apply(lambda x: x.replace(' ', ''))

# Concatenate State and County as State_County
fires['State_County'] = fires['State'] + '_' + fires['County']

In [259]:
# Change start and containment date column values to only include month
fires['Start'] = fires['Start Date'].str.replace(r' \d*', '', regex=True)
fires['Start'] = fires['Start'].str.replace(r'[^a-zA-Z0-9\s]', '', regex=True)

fires['End'] = fires['Containment Date'].str.replace(r' \d*', '', regex=True)
fires['End'] = fires['End'].str.replace(r'[^a-zA-Z0-9\s]', '', regex=True)

# Only select desired columns
    # Note: County should NOT be used since county names may be repeated across states and could compromise data analysis
fires = fires[['State', 'State_County', 'Start', 'End']]

fires.head()

    State          State_County Start      End
0  Alaska  Alaska_Yukon-Koyukuk  June  October
1  Alaska         Alaska_Denali  June  October
2  Alaska         Alaska_Bethel  June   August
3  Alaska         Alaska_Denali  June  October
4  Alaska         Alaska_Denali  June  October

In [260]:
# Print set of all values in the Start and End columns
months = set(fires.loc[:,'Start']).union(set(fires.loc[:,'Start']))
print(months)

{'July', 'August', 'September', 'May', 'February', 'November', 'March', 'June', 'October', 'April', 'December'}

In [261]:
# Convert months to digits and add the range of months the fire lasted
replace_map = {'January': 1, 'February': 2, 'March': 3, 'April': 4, 'May': 5, 'June': 6, 'July': 7, 'August': 8, 'September': 9, 'October': 10, 'November': 11, 'December': 12, 'unknown':  np.nan}
fires.Start = fires.Start.map(replace_map)
fires.End = fires.End.map(replace_map)

In [262]:
fires['Start'].astype(float)
fires['End'].astype(float)

0      10.0
1      10.0
2       8.0
3      10.0
4      10.0
       ...
467     9.0
468     9.0
469     9.0
470     9.0
471     9.0
Name: End, Length: 472, dtype: float64

In [263]:
fires.head()

    State          State_County  Start   End
0  Alaska  Alaska_Yukon-Koyukuk    6.0  10.0
1  Alaska         Alaska_Denali    6.0  10.0
2  Alaska         Alaska_Bethel    6.0   8.0
3  Alaska         Alaska_Denali    6.0  10.0
4  Alaska         Alaska_Denali    6.0  10.0

In [264]:
# How many NaN's? Is it safe to remove?
fires.isna().sum()

# Take out the fires that we don't know when they endedd
fires = fires.dropna()

In [265]:
# Which months did each fire burn for? All numbers between start and end, inclusive on both ends.

fires['Months'] = [[] for _ in range(len(fires))]

for idx in fires.index:
    start = int(fires.loc[idx, 'Start'])
    end = int(fires.loc[idx, 'End'])

    
    months = list(range(start, end + 1))
    
    fires.at[idx, 'Months'] = months

    print(idx, fires.loc[idx, 'Months'])

0 [6, 7, 8, 9, 10]
1 [6, 7, 8, 9, 10]
2 [6, 7, 8]
3 [6, 7, 8, 9, 10]
4 [6, 7, 8, 9, 10]
5 [6, 7, 8, 9, 10]
6 [6, 7, 8, 9, 10]
7 [6, 7, 8, 9, 10]
8 [6, 7, 8, 9, 10]
9 [6, 7, 8, 9]
10 [6, 7, 8]
11 [6, 7, 8, 9, 10]
12 [6, 7, 8, 9, 10]
13 [6, 7, 8, 9]
14 [6, 7, 8, 9]
15 [6, 7, 8, 9, 10]
16 [6, 7, 8, 9, 10]
17 [6, 7, 8, 9]
18 [6, 7, 8]
19 [6, 7, 8]
20 [6, 7, 8]
21 [6, 7, 8]
22 [6, 7, 8]
23 [6, 7, 8]
24 [6, 7, 8]
25 [6, 7, 8]
26 [6, 7]
27 [6, 7, 8, 9]
28 [6, 7, 8, 9]
29 [9]
30 [5, 6, 7]
31 [5]
32 [5, 6, 7]
33 [5]
35 [3]
36 [6, 7, 8]
37 [6, 7]
38 [6, 7]
39 [6, 7, 8, 9]
40 [6]
41 [6, 7]
42 [6]
43 [7, 8]
44 [7, 8]
45 [7, 8]
46 [7, 8]
47 [7, 8]
48 [7, 8]
49 [7, 8]
50 [7, 8]
51 [7, 8, 9]
52 [7, 8]
53 [7, 8]
54 [7, 8]
55 [7]
56 [8, 9]
57 [8, 9]
58 [8]
59 [8]
60 [8]
61 [8, 9]
62 [8]
63 [4, 5, 6, 7]
64 []
65 [10]
66 [10]
67 [9, 10]
68 [9]
69 [9]
71 [8, 9]
72 [7]
73 [7]
74 [7]
76 [6]
77 [6]
78 [6]
79 [7, 8, 9]
80 [12]
81 [11]
82 [10, 11, 12]
83 [10]
84 [10, 11]
85 [9, 10]
86 [9, 10, 11]
87 [9]
88 [9, 10, 11, 12]
89 [9]
90 [9]
91 [9]
92 [8, 9]
93 [8]
94 [8, 9, 10, 11, 12]
95 [7, 8]
96 [7, 8]
97 [7, 8, 9]
98 [7]
99 [7]
100 [7, 8]
101 [7, 8]
102 [7]
103 [7]
104 [7, 8, 9, 10, 11]
105 [7, 8]
106 [7]
107 [7]
108 [7]
109 [7, 8, 9]
110 [7]
111 [7]
112 [7]
113 [7, 8]
114 [7, 8]
115 [7, 8]
116 [7]
117 [7]
118 [7]
119 [7]
120 [6, 7]
121 [6, 7]
122 [6]
123 [6]
124 [6]
125 [6]
126 [6]
127 [6]
128 [6]
129 [6]
130 [5]
131 [5, 6]
132 [5]
133 [5]
134 [5]
135 [3]
137 [7, 8]
138 [7, 8]
139 [7]
140 [7]
141 [2, 3]
142 [2, 3]
143 [8]
144 [8]
145 [4, 5]
146 [9, 10]
147 [5, 6]
148 [5]
149 [6, 7]
150 [5, 6]
151 [3, 4]
152 [2, 3]
153 [4, 5, 6, 7, 8]
155 [7]
156 [8]
157 [8]
158 [10]
159 [10]
160 [9, 10]
161 [9, 10]
162 [9, 10]
163 [9, 10, 11]
164 [9]
165 [9, 10]
166 [9, 10]
167 [9, 10, 11]
168 [9, 10]
169 [9]
170 [9]
171 [9, 10]
172 [9]
173 [9]
174 [9, 10]
175 [9, 10]
176 [9]
177 [8, 9, 10, 11]
178 [8, 9, 10]
179 [8, 9, 10]
180 [8, 9, 10]
181 [8, 9, 10]
182 [8]
183 [8, 9, 10]
184 [8, 9, 10]
185 [8, 9, 10]
186 [8, 9, 10]
187 [8]
188 [8, 9, 10]
189 [8, 9, 10]
190 [8, 9]
191 [8, 9, 10]
192 [8, 9, 10]
193 [8]
194 [8, 9, 10]
195 [8, 9, 10]
196 [8]
197 [7, 8, 9, 10]
198 [7, 8, 9, 10, 11]
199 [7, 8]
200 [7, 8, 9, 10]
201 [7, 8]
202 [7, 8, 9]
203 [7, 8]
204 [7]
205 [7]
206 [7, 8, 9, 10]
207 [7]
208 [7, 8, 9]
209 [7, 8]
210 [7]
211 [7]
212 [7, 8]
213 [7]
214 [7]
215 [7, 8]
216 [6, 7]
217 [6]
218 [6]
219 [6]
220 [4]
221 [8]
222 [11, 12]
223 [3]
224 [3]
225 [2]
226 [2, 3, 4]
227 [4, 5, 6]
228 [3, 4, 5, 6]
229 [7, 8, 9, 10]
230 [7, 8, 9, 10, 11]
231 [7, 8]
232 [7]
233 [7]
234 [7]
235 [7]
236 [7, 8, 9]
237 [7, 8]
238 [8, 9]
240 [8]
241 [8]
242 [8, 9, 10]
243 [8, 9, 10, 11]
244 [8]
246 [9]
247 [8]
248 [8]
249 [7, 8, 9, 10, 11]
250 [7, 8]
251 [7, 8]
252 [8, 9]
253 [9, 10, 11]
254 [2, 3]
255 [9]
256 [10]
257 [6, 7]
258 [6, 7]
260 [7, 8]
261 [7]
262 [7]
263 [7]
264 [8]
265 [8]
266 [8, 9]
270 [5, 6, 7]
273 [6, 7, 8]
274 [6, 7]
275 [7, 8]
276 [7, 8]
277 [7, 8, 9]
278 [7]
279 [8]
280 [11]
281 [10]
282 [10]
283 [10, 11]
285 [3, 4]
286 [3, 4]
287 [3, 4]
288 [3, 4]
289 [2, 3]
290 [2, 3]
291 [2]
292 [2, 3]
294 [4]
295 [10, 11]
296 [10, 11]
297 [10]
298 [10, 11]
299 [10, 11]
300 [10, 11]
301 [10]
302 [7, 8]
303 [10]
304 [9, 10, 11]
305 [9, 10]
306 [9, 10, 11]
307 [9, 10]
308 [9, 10]
309 [9]
310 [9, 10]
311 [9, 10, 11]
312 [9, 10]
313 [9, 10]
314 [9]
315 [9]
316 [9]
317 [9, 10, 11]
318 [9]
319 [9, 10]
320 [9]
321 [9]
322 [8]
323 [8]
324 [8]
325 [8]
326 [8]
327 [8]
328 [8]
329 [7, 8]
330 [7, 8]
331 [7, 8]
332 [7, 8]
333 [7, 8]
334 [7]
335 [7, 8]
336 [7]
337 [7]
338 [7, 8]
339 [7, 8, 9]
340 [7, 8]
341 [7]
342 [7, 8]
343 [7, 8]
344 [7, 8, 9, 10]
345 [7, 8, 9, 10, 11]
346 [7, 8, 9, 10, 11]
347 [7, 8, 9, 10, 11]
348 [7, 8, 9, 10, 11]
349 [7, 8]
350 [7, 8, 9]
351 [7, 8]
352 [7]
353 [7, 8, 9, 10, 11]
354 [7, 8, 9, 10]
355 [7]
356 [7, 8, 9, 10]
357 [7, 8, 9, 10]
358 [7, 8, 9]
359 [7]
361 [7, 8, 9]
362 [7, 8, 9]
363 [7, 8, 9, 10]
364 [7]
365 [7]
366 [7]
367 [7, 8]
368 [7]
369 [7]
370 [7]
371 [6, 7]
372 [6, 7, 8, 9, 10]
373 [6, 7]
374 [6, 7]
375 [6]
376 [6, 7, 8]
377 [4, 5]
378 [9, 10]
379 [9, 10]
380 [7, 8, 9]
381 [7]
382 [8, 9]
383 [5]
384 [5]
385 [3]
386 [6, 7]
387 [7, 8]
388 [2, 3]
389 [2, 3]
390 [2, 3]
391 [2]
392 [2]
393 [8]
394 [8]
395 [8]
396 [8]
397 [8]
398 [8]
399 [8]
400 [8]
401 [4]
402 [2, 3]
403 [9, 10, 11]
404 [9]
405 [8]
406 [7, 8]
407 [7]
408 [7, 8]
409 [7, 8]
410 [5, 6, 7, 8]
412 [3, 4]
413 [3, 4]
415 [3, 4]
416 [7]
417 [10]
418 [9]
419 [9, 10]
420 [8]
421 [8, 9, 10]
422 [8, 9, 10, 11]
423 [8]
424 [7, 8]
425 [7, 8]
426 [7, 8]
427 [7]
428 [7]
429 [7, 8, 9, 10]
430 [7, 8]
431 [7, 8]
432 [7, 8, 9, 10]
433 [7, 8]
434 [7]
435 [7, 8]
436 [6, 7]
437 [6]
438 [6]
439 [6]
440 [6, 7, 8, 9, 10]
441 [9]
442 [3]
443 [3, 4, 5, 6, 7]
444 [6]
445 [6]
446 [7, 8]
447 [7, 8, 9]
448 [7]
449 [7, 8]
450 [7, 8, 9, 10, 11, 12]
451 [7]
452 [7]
453 [2]
455 [2, 3]
456 [8, 9]
457 [8, 9]
458 [8, 9]
459 [8, 9]
460 [8]
461 [8]
462 [10]
463 [9, 10, 11]
464 [9, 10, 11]
465 [9]
466 [9]
467 [9]
468 [9]
469 [9]
470 [9]
471 [8, 9]

In [266]:
print(fires)

       State          State_County  Start   End            Months
0     Alaska  Alaska_Yukon-Koyukuk    6.0  10.0  [6, 7, 8, 9, 10]
1     Alaska         Alaska_Denali    6.0  10.0  [6, 7, 8, 9, 10]
2     Alaska         Alaska_Bethel    6.0   8.0         [6, 7, 8]
3     Alaska         Alaska_Denali    6.0  10.0  [6, 7, 8, 9, 10]
4     Alaska         Alaska_Denali    6.0  10.0  [6, 7, 8, 9, 10]
..       ...                   ...    ...   ...               ...
467  Wyoming      Wyoming_Converse    9.0   9.0               [9]
468  Wyoming      Wyoming_Campbell    9.0   9.0               [9]
469  Wyoming       Wyoming_Natrona    9.0   9.0               [9]
470  Wyoming    Wyoming_HotSprings    9.0   9.0               [9]
471  Wyoming        Wyoming_Weston    8.0   9.0            [8, 9]

[453 rows x 5 columns]

In [267]:
# Replace map to change numbers to month names for readability
replace_map = {1: 'January', 2: 'February', 3: 'March', 4: 'April', 5: 'May', 6: 'June', 7: 'July', 8: 'August', 9: 'September', 10: 'October', 11: 'November', 12: 'December', np.nan: 'unknown'}

fires.Start = fires.Start.map(replace_map)
fires.End = fires.End.map(replace_map)

fires.head()

    State          State_County Start      End            Months
0  Alaska  Alaska_Yukon-Koyukuk  June  October  [6, 7, 8, 9, 10]
1  Alaska         Alaska_Denali  June  October  [6, 7, 8, 9, 10]
2  Alaska         Alaska_Bethel  June   August         [6, 7, 8]
3  Alaska         Alaska_Denali  June  October  [6, 7, 8, 9, 10]
4  Alaska         Alaska_Denali  June  October  [6, 7, 8, 9, 10]

In [268]:
# Explode the months column for ease of replace map usage
exploded_fires = fires.explode('Months')

# Replace numbers with months once again
exploded_fires.Months = exploded_fires.Months.map(replace_map)

exploded_fires.head()

    State          State_County Start      End     Months
0  Alaska  Alaska_Yukon-Koyukuk  June  October       June
0  Alaska  Alaska_Yukon-Koyukuk  June  October       July
0  Alaska  Alaska_Yukon-Koyukuk  June  October     August
0  Alaska  Alaska_Yukon-Koyukuk  June  October  September
0  Alaska  Alaska_Yukon-Koyukuk  June  October    October

In [269]:
# Replace fires with the exploded_fires df aggregated and grouped to recover original format (list in the Months column)
# Group by the columns you want to remain as unique IDs
# .agg(list) applies list agg function to each group, recreating the list
# Don't forget to reset index
fires = exploded_fires.groupby(['State', 'State_County', 'Start', 'End']).agg(list).reset_index()

# Convert the list to a string for readability
fires['Months'] = fires['Months'].apply(lambda x: ', '.join(x))

fires.head()

,State,State_County,Start,End,Months
0,Alaska,Alaska_Bethel,June,August,"June, July, August, June, July, August, June, ..."
1,Alaska,Alaska_Denali,June,October,"June, July, August, September, October, June, ..."
2,Alaska,Alaska_FairbanksNorthStar,June,October,"June, July, August, September, October, June, ..."
3,Alaska,Alaska_FairbanksNorthStar,June,September,"June, July, August, September, June, July, Aug..."
4,Alaska,Alaska_LakeandPeninsula,June,July,"June, July"

In [270]:
# Only keep one item in list if start and end month are the same
for idx in range(len(fires)):
    if fires.loc[idx, 'Start'] == fires.loc[idx, 'End']:
        fires.loc[idx, 'Months'] = [fires.loc[idx, 'Start']]

fires

,State,State_County,Start,End,Months
0,Alaska,Alaska_Bethel,June,August,"June, July, August, June, July, August, June, ..."
1,Alaska,Alaska_Denali,June,October,"June, July, August, September, October, June, ..."
2,Alaska,Alaska_FairbanksNorthStar,June,October,"June, July, August, September, October, June, ..."
3,Alaska,Alaska_FairbanksNorthStar,June,September,"June, July, August, September, June, July, Aug..."
4,Alaska,Alaska_LakeandPeninsula,June,July,"June, July"
...,...,...,...,...,...
366,Wyoming,"Wyoming_Platte,Goshen",July,August,"July, August"
367,Wyoming,Wyoming_Sheridan,September,November,"September, October, November"
368,Wyoming,"Wyoming_Sheridan,Campbell,Johnson",August,August,[August]
369,Wyoming,Wyoming_Teton&Fremont,September,November,"September, October, November"
370,Wyoming,Wyoming_Weston,August,September,"August, September"

In [271]:
# Create a column counting the number of months a fire burned, leave each entry empty for now (pd.NA so count can be an int)
fires['Num_Months'] = pd.NA

# For each row in fires df
for idx in range(len(fires)):
    # Initialize count variable as an int
    count = 0
    # For each item in the Months list
    for item in fires.loc[idx, 'Months']:
        count += 1
    fires.loc[idx, 'Num_Months'] = int(count)

fires.head()

,State,State_County,Start,End,Months,Num_Months
0,Alaska,Alaska_Bethel,June,August,"June, July, August, June, July, August, June, ...",138
1,Alaska,Alaska_Denali,June,October,"June, July, August, September, October, June, ...",198
2,Alaska,Alaska_FairbanksNorthStar,June,October,"June, July, August, September, October, June, ...",118
3,Alaska,Alaska_FairbanksNorthStar,June,September,"June, July, August, September, June, July, Aug...",60
4,Alaska,Alaska_LakeandPeninsula,June,July,"June, July",10

In [272]:
# Convert fires df to a cleaned csv, saved in user's cwd 
fires.to_csv('./2024USFires_cleaned.csv')